Revit 2024 API
AnalysisDisplayStyle.GetVectorSettings Method
 Get vector settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public AnalysisDisplayVectorSettings GetVectorSettings()
Visual Basic
Public Function GetVectorSettings As AnalysisDisplayVectorSettings
Visual C++
public:
AnalysisDisplayVectorSettings^ GetVectorSettings()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  vector settings were not created with the object.
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace